---
kind: method
id: M:Autodesk.Revit.DB.Outline.Dispose
source: html/d96f78d8-4cca-f6f9-c605-f3330453d937.htm
---
# Autodesk.Revit.DB.Outline.Dispose Method

Releases all resources used by the Outline

## Syntax (C#)
```csharp
public void Dispose()
```